Белгипрозем_2017/src/Documents/мСмета/мСмета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>мСмета</name>
  <registerRecords>AccumulationRegister.Сметы</registerRecords>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ВнутренниеДокументы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРабот</name>
    <type>
      <types>CatalogRef.мВидыРаботЮрЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектРабот</name>
    <type>
      <types>CatalogRef.мОбъектыРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>Смета</name>
    <type>
      <types>CatalogRef.мСметы</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Всего</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Акт</name>
    <type>
      <types>CatalogRef.ВнутренниеДокументы</types>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОбъемРабот</name>
    <attributes>
      <name>СтадияРабот</name>
      <type>
        <types>CatalogRef.мСтадииРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Белгипрозем_2017/src/Catalogs/мСметы/мСметы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>мСметы</name>
  <owners>Catalog.ВнутренниеДокументы</owners>
  <attributes>
    <name>НомерСметы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.мСостоянияСмет</types>
    </type>
  </attributes>
  <attributes>
    <name>Корреспондент</name>
    <type>
      <types>CatalogRef.Корреспонденты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапДоговора</name>
    <type>
      <types>CatalogRef.мЭтапыДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектРабот</name>
    <type>
      <types>CatalogRef.мОбъектыРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>КарточкаОбъектаРабот</name>
    <type>
      <types>CatalogRef.мКарточкиОбъектовРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонСметы</name>
    <type>
      <types>CatalogRef.мШаблоныСмет</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРасчетаСметы</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Итого</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИндексЦен</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Трассировка</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Подписал</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Проверил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Составил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеСметы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.мСтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсвобождениеОтНДС</name>
    <type>
      <types>CatalogRef.мОсвобождениеОтНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстИндексЦен</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоляОбъекта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидРабот</name>
    <type>
      <types>CatalogRef.мВидыРаботЮрЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>НаГод</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Рентабельность</name>
    <type>
      <types>CatalogRef.мРентабельность</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СтадииРабот</name>
    <attributes>
      <name>Использовать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СтадияРабот</name>
      <type>
        <types>CatalogRef.мСтадииРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>Процент</name>
      <comment>Процент использования таблицы в смете</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТаблицаНормВремени</name>
      <type>
        <types>CatalogRef.мТаблицыНормВремени</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиТаблицы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Примечания</name>
    <attributes>
      <name>Использовать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СтадияРабот</name>
      <type>
        <types>CatalogRef.мСтадииРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>CatalogRef.мПримечанияНормВремени</types>
      </type>
    </attributes>
    <attributes>
      <name>СсылкаНаСборник</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КоэффициентПримечания</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПараметрОбъекта</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ПараметрыОбъектов</types>
      </type>
    </attributes>
    <attributes>
      <name>ТаблицаНормВремени</name>
      <type>
        <types>CatalogRef.мТаблицыНормВремени</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиТаблицы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НормаВремени</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОбъемРабот</name>
    <attributes>
      <name>Использовать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СтадияРабот</name>
      <type>
        <types>CatalogRef.мСтадииРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>СсылкаНаСборник</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КолонкаТаблицы</name>
      <type>
        <types>CatalogRef.мКолонкиТаблиц</types>
      </type>
    </attributes>
    <attributes>
      <name>СтрокаТаблицы</name>
      <type>
        <types>CatalogRef.мСтрокиТаблиц</types>
      </type>
    </attributes>
    <attributes>
      <name>ПараметрКолонки</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ПараметрыОбъектов</types>
      </type>
    </attributes>
    <attributes>
      <name>ПараметрСтрокиДляУсловия</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ПараметрыОбъектов</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияКолонки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияСтрокиДляУсловия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеКолонки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеСтрокиДляУсловия</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РасчетСтоимости</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НормаВремени</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Стоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НормаВремениНачальная</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тариф</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Продолжительность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПараметрСтрокиДляКоличества</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ПараметрыОбъектов</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияСтрокиДляКоличества</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеСтрокиДляКоличества</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Корреспонденты</name>
    <attributes>
      <name>Корреспондент</name>
      <type>
        <types>CatalogRef.Корреспонденты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Белгипрозем_2017/src/Documents/мСмета/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.Договор) Тогда
		Корреспондент = Объект.Договор.Корреспондент;
		УстановитьСвязьПараметровВыбораОбъектаРабот(Элементы)
	КонецЕсли; 
	
	ВидАкта = Справочники.ВидыВнутреннихДокументов.АктВыполненныхРабот;
	
	Если ЗначениеЗаполнено(Объект.Смета) Тогда
		Если ЗначениеЗаполнено(Объект.Смета.ЭтапДоговора) Тогда
			ЭтапДоговора = Объект.Смета.ЭтапДоговора; 
			УстановитьСвязьПараметровВыбораАкта(ЭтаФорма);
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьДоступностьИтогов();
КонецПроцедуры
 
&НаКлиенте
Процедура ОбъемРаботПередУдалением(Элемент, Отказ)
	РассчитатьИтогиСметы();
	УстановитьДоступностьИтогов();
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьИтогиСметы()
	Объект.Сумма = 0;
	Объект.НДС = 0;
	Для каждого СтрСметы Из Объект.ОбъемРабот Цикл
		Объект.Сумма = Объект.Сумма + СтрСметы.Сумма;
		Объект.НДС = Объект.НДС + СтрСметы.НДС;
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьИтогов()
	НетРасчета = Объект.ОбъемРабот.Количество() = 0;
	Элементы.ГруппаИтоги.Доступность = НетРасчета;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКорреспондентаДоговора(Договор)
	Возврат Договор.Корреспондент;	
КонецФункции


&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	Корреспондент = ПолучитьКорреспондентаДоговора(Объект.Договор);	
	УстановитьСвязьПараметровВыбораОбъектаРабот(Элементы);
КонецПроцедуры
 
&НаСервереБезКонтекста
Процедура УстановитьСвязьПараметровВыбораОбъектаРабот(Элементы)
	НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.Владелец", "Корреспондент");
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(НоваяСвязь);
	НовыеСвязи = Новый ФиксированныйМассив(НовыйМассив);
	Элементы.ОбъектРабот.СвязиПараметровВыбора = НовыеСвязи;
КонецПроцедуры 

&НаКлиенте
Процедура СметаПриИзменении(Элемент)
	ЗаполнитьОбъемРабот();
	Если ЗначениеЗаполнено(ЭтапДоговора) Тогда
		УстановитьСвязьПараметровВыбораАкта(ЭтаФорма);
	КонецЕсли; 
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьСвязьПараметровВыбораАкта(ЭтаФорма)
	//НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.ЭтапДоговора", "ЭтапДоговора");
	//НоваяСвязь2 = Новый СвязьПараметраВыбора("Отбор.ВидДокумента", "ВидАкта");
	//НовыйМассив = Новый Массив();
	//НовыйМассив.Добавить(НоваяСвязь);
	//НовыйМассив.Добавить(НоваяСвязь2);
	//НовыеСвязи = Новый ФиксированныйМассив(НовыйМассив);
	//ЭтаФорма.Элементы.Акт.СвязиПараметровВыбора = НовыеСвязи;
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьОбъемРабот()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	мСметыОбъемРабот.СтадияРабот КАК СтадияРабот,
		|	СУММА(мСметыОбъемРабот.Стоимость) КАК Сумма,
		|	МАКСИМУМ(мСметыОбъемРабот.Ссылка.СтавкаНДС.Ставка) КАК СтавкаНДСЗначение,
		|	МАКСИМУМ(мСметыОбъемРабот.Ссылка.КОплате) КАК Всего,
		|	МАКСИМУМ(мСметыОбъемРабот.Ссылка.НДС) КАК НДС,
		|	МАКСИМУМ(мСметыОбъемРабот.Ссылка.ЭтапДоговора) КАК ЭтапДоговора
		|ИЗ
		|	Справочник.мСметы.ОбъемРабот КАК мСметыОбъемРабот
		|ГДЕ
		|	мСметыОбъемРабот.Ссылка = &Смета
		|
		|СГРУППИРОВАТЬ ПО
		|	мСметыОбъемРабот.СтадияРабот,
		|	мСметыОбъемРабот.Ссылка.ЭтапДоговора";
	
	Запрос.УстановитьПараметр("Смета", Объект.Смета);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Объект.ОбъемРабот.Очистить();
	
	ЭтоПерваяСтрока = Истина;
	ЭтапДоговора = Неопределено;
	
	Пока Выборка.Следующий() Цикл
		Стр = Объект.ОбъемРабот.Добавить();
		ЗаполнитьЗначенияСвойств(Стр, Выборка);
		
		Объект.Сумма = Объект.Сумма + Стр.Сумма;
		
		Если ЭтоПерваяСтрока Тогда
			ЭтоПерваяСтрока = Ложь;
			ЗаполнитьЗначенияСвойств(Объект, Выборка, ,"Сумма");
			ЭтапДоговора = Выборка.ЭтапДоговора;
		КонецЕсли; 
	КонецЦикла;
	
КонецПроцедуры 

&НаКлиенте
Процедура АктНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ВидДокумента", ПредопределенноеЗначение("Справочник.ВидыВнутреннихДокументов.АктВыполненныхРабот"));
	ПараметрыОтбора.Вставить("ЭтапДоговора", ЭтапДоговора);
	ПараметрыФормы = Новый Структура("Отбор", ПараметрыОтбора);
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ОткрытьФорму("Справочник.ВнутренниеДокументы.ФормаВыбора", ПараметрыФормы, Элемент);
КонецПроцедуры
